content-org/Hugo.org
#+hugo_base_dir: ~/Code/Github/blog-hugo
#+hugo_section: post
#+hugo_auto_set_lastmod: t
#+author: 
#+hugo_custom_front_matter: :author "Qiangua"
#+hugo_code_fence: nil
# eval: (org-hugo-auto-export-mode)

** DONE Encryption                                                :curious:
CLOSED: [2019-12-16 Mon 00:34]
:PROPERTIES:
:EXPORT_FILE_NAME: Encryption
:EXPOET_DATE: 2019-12-11
:END:
- State "DONE"       from "TODO"       [2019-12-16 Mon 00:34]
*** Symmetric Cryptography

  #+BEGIN_SRC shell
  openssl aes-256- -a -e -in file-in.txt -inkey key.txt -out file-out.txt
  openssl aes-256- -a -d -in file-in.txt -inkey key.txt -out file-out.txt
#+END_SRC
*** Asymmetric Cryptography
  
**** generate private key
  #+BEGIN_SRC shell
  openssl genrsa -out private.pem 1024
  #+END_SRC
 
**** generate public key from private key
  #+BEGIN_SRC shell
  openssl rsa -in private.pem -pubout -out public.pem
  #+END_SRC
 
**** encrypt file with public key
  #+BEGIN_SRC shell
  openssl rsautl -encrypt -in test.org -inkey public.pem -pubin -out encrypted.inc
  #+END_SRC
 
**** decrypt file wiht private key
  #+BEGIN_SRC shell
  openssl rsatul -decrypt -in encrypted.inc -inkey private.pem -out decrypted.org
  #+END_SRC
*** GNUGPG
GNUGPG is a practical terminal tool for encryption. Here are two typical commands
#+BEGIN_SRC shell
gpg --encrypt -r ID test.txt
gpg --decrypt test.txt.gpg --out-put test.de.txt
#+END_SRC